20240120172537-declaring_abstract_methods.org
:PROPERTIES:
:ID:       3e6ed9f7-a719-4f68-94f0-29cb4914ebf2
:END:
#+title: Declaring Abstract Methods
#+property: header-args :tangle code/ocp/6/declaring_abstract_methods.java

* Declaring Abstract Methods

An ~abstract method~ is *always* declared *without* a ~body~.

It also includes a semicolon =(;)= after the *method declaration*.

It might surprise you to know that an ~abstract class~ is *not* required to include any ~abstract methods~.

** Example

For example, the following code compiles even though it doesn’t define any abstract methods:

#+BEGIN_SRC java
public abstract class Llama {
    public void chew() {}
}
#+END_SRC


** _Exam Trick_

Even without abstract methods, the class cannot be directly instantiated.

For the exam, keep an eye out for abstract methods declared outside abstract classes, such as the following:
#+BEGIN_SRC java
public class Egret { // DOES NOT COMPILE
    public abstract void peck();
}
#+END_SRC

The exam creators like to include invalid ~class~ declarations, mixing ~non­abstract classes~ with ~abstract methods~.

** Example

Like the ~final~ modifier, the ~abstract~ modifier can be placed *before* or *after* the [[id:8e0bae56-3a80-4227-ad57-4c5fd3070cd5][Class Access Modifiers]] in ~class~ and ~method declarations~:

#+BEGIN_SRC java
abstract public class Tiger {
    abstract public int claw();
}
#+END_SRC


** _Exam Trick_

The ~abstract~ modifier cannot be placed *after* the ~class~ keyword in a class declaration or after the ~return type~ in a ~method declaration~.
The following ~Bear~ and ~howl()~ declarations do not compile for these reasons:

#+BEGIN_SRC java
public class abstract Bear { // DOES NOT COMPILE
    public int abstract howl(); // DOES NOT COMPILE
}
#+END_SRC


** _Exam Trick_

It is not possible to define an ~abstract method~ that has a body or default implementation.
You *can* still define a default method with a body ­ you just can’t mark it as ~abstract~.
As long as you do not mark the method as ~final~, the ~subclass~ has the option to *override* the ~inherited method~.
