20240120172537-declaring_abstract_methods.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 14:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Declaring Abstract Methods</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Declaring Abstract Methods</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbb4325b">1. Declaring Abstract Methods</a>
<ul>
<li><a href="#org1822428">1.1. Example</a></li>
<li><a href="#orgfb7b58e">1.2. <span class="underline">Exam Trick</span></a></li>
<li><a href="#orgfff3bf5">1.3. Example</a></li>
<li><a href="#org8581f89">1.4. <span class="underline">Exam Trick</span></a></li>
<li><a href="#org3910398">1.5. <span class="underline">Exam Trick</span></a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgbb4325b" class="outline-2">
<h2 id="orgbb4325b"><span class="section-number-2">1.</span> Declaring Abstract Methods</h2>
<div class="outline-text-2" id="text-1">
<p>
An <code>abstract method</code> is <b>always</b> declared <b>without</b> a <code>body</code>.
</p>

<p>
It also includes a semicolon <code>(;)</code> after the <b>method declaration</b>.
</p>

<p>
It might surprise you to know that an <code>abstract class</code> is <b>not</b> required to include any <code>abstract methods</code>.
</p>
</div>

<div id="outline-container-org1822428" class="outline-3">
<h3 id="org1822428"><span class="section-number-3">1.1.</span> Example</h3>
<div class="outline-text-3" id="text-1-1">
<p>
For example, the following code compiles even though it doesn’t define any abstract methods:
</p>

<div class="org-src-container">
<pre class="src src-java">public abstract class Llama {
    public void chew() {}
}
</pre>
</div>
</div>
</div>


<div id="outline-container-orgfb7b58e" class="outline-3">
<h3 id="orgfb7b58e"><span class="section-number-3">1.2.</span> <span class="underline">Exam Trick</span></h3>
<div class="outline-text-3" id="text-1-2">
<p>
Even without abstract methods, the class cannot be directly instantiated.
</p>

<p>
For the exam, keep an eye out for abstract methods declared outside abstract classes, such as the following:
</p>
<div class="org-src-container">
<pre class="src src-java">public class Egret { // DOES NOT COMPILE
    public abstract void peck();
}
</pre>
</div>

<p>
The exam creators like to include invalid <code>class</code> declarations, mixing <code>non­abstract classes</code> with <code>abstract methods</code>.
</p>
</div>
</div>

<div id="outline-container-orgfff3bf5" class="outline-3">
<h3 id="orgfff3bf5"><span class="section-number-3">1.3.</span> Example</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Like the <code>final</code> modifier, the <code>abstract</code> modifier can be placed <b>before</b> or <b>after</b> the <a href="20240114162548-class_access_modifiers.html#ID-8e0bae56-3a80-4227-ad57-4c5fd3070cd5">Class Access Modifiers</a> in <code>class</code> and <code>method declarations</code>:
</p>

<div class="org-src-container">
<pre class="src src-java">abstract public class Tiger {
    abstract public int claw();
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org8581f89" class="outline-3">
<h3 id="org8581f89"><span class="section-number-3">1.4.</span> <span class="underline">Exam Trick</span></h3>
<div class="outline-text-3" id="text-1-4">
<p>
The <code>abstract</code> modifier cannot be placed <b>after</b> the <code>class</code> keyword in a class declaration or after the <code>return type</code> in a <code>method declaration</code>.
The following <code>Bear</code> and <code>howl()</code> declarations do not compile for these reasons:
</p>

<div class="org-src-container">
<pre class="src src-java">public class abstract Bear { // DOES NOT COMPILE
    public int abstract howl(); // DOES NOT COMPILE
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org3910398" class="outline-3">
<h3 id="org3910398"><span class="section-number-3">1.5.</span> <span class="underline">Exam Trick</span></h3>
<div class="outline-text-3" id="text-1-5">
<p>
It is not possible to define an <code>abstract method</code> that has a body or default implementation.
You <b>can</b> still define a default method with a body ­ you just can’t mark it as <code>abstract</code>.
As long as you do not mark the method as <code>final</code>, the <code>subclass</code> has the option to <b>override</b> the <code>inherited method</code>.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
